Tekla Open API Reference for Tekla Structures 2025
BaseRebarModifier.BarsAffected Property
 Gets or sets the reinforcing bars affected.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BaseRebarModifier.BarsAffectedEnum BarsAffected { get; set; }
Public Property BarsAffected As BaseRebarModifier.BarsAffectedEnum
	Get
	Set
Property Value
Type: BaseRebarModifier.BarsAffectedEnum
See Also
Reference
BaseRebarModifier Class
Tekla.Structures.Model Namespace